# Connecting to the "Airlines" Database

In [1]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [2]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [3]:
%load_ext sql

# Tasks

## For the given ticket_no 0005432312164, find: who and where flew.

### A query with subqueries (nested queries)

In [4]:
%%sql $CONNECT_DATA

SELECT passenger_name
FROM Tickets
WHERE ticket_no = '0005432312164'

1 rows affected.

[('ALEKSEY GERASIMOV',)]

### A query with no subqueries and no joins

In [5]:
%%sql

SELECT passenger_name, departure_airport, arrival_airport
FROM Tickets
JOIN Ticket_flights USING (ticket_no)
JOIN Flights USING (flight_id)
WHERE ticket_no = '0005432312164'

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

### A query with joins

In [6]:
%%sql

SELECT passenger_name, departure_airport, arrival_airport
FROM Tickets
JOIN Ticket_flights ON Tickets.ticket_no = Ticket_flights.ticket_no
JOIN Flights ON Ticket_flights.flight_id = Flights.flight_id
WHERE Tickets.ticket_no = '0005432312164'

 * postgresql://reader:***@10.129.0.25/demo
4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

## Extend that solution about Mrs. 'ELLA DMITRIEVA' - from where and to where she flew.

In [15]:
%%sql

SELECT departure.city AS from,
       arrival.city AS to
FROM Flights
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
JOIN Airports AS departure ON Flights.departure_airport = departure.airport_code
JOIN Airports AS arrival ON Flights.arrival_airport = arrival.airport_code
WHERE Tickets.passenger_name = 'ELLA DMITRIEVA'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg'),
 ('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow')]

## Output a grid: Aircraft model/Total number of seats.

In [19]:
%%sql

SELECT Aircrafts.model AS aircraft_model,
       COUNT(Seats.seat_no) AS seats_number
FROM Aircrafts
JOIN Seats ON Aircrafts.aircraft_code = Seats.aircraft_code
GROUP BY Aircrafts.model
ORDER BY seats_number

 * postgresql://reader:***@10.129.0.25/demo
9 rows affected.

[('Cessna 208 Caravan', 12),
 ('Bombardier CRJ-200', 50),
 ('Sukhoi Superjet-100', 97),
 ('Airbus A319-100', 116),
 ('Boeing 737-300', 130),
 ('Airbus A320-200', 140),
 ('Airbus A321-200', 170),
 ('Boeing 767-300', 222),
 ('Boeing 777-300', 402)]

# Conclusion
- 1
- 2
- 3